Revit 2027 API
SynchronizeWithCentralOptions.SaveLocalAfter Property
 True means to save local after saving changes to central. True by default. Silently ignored if the model in the current session is central rather than local.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SaveLocalAfter { get; set; }
Public Property SaveLocalAfter As Boolean
	Get
	Set
public:
property bool SaveLocalAfter {
	bool get ();
	void set (bool value);
}
member SaveLocalAfter : bool with get, set
Property Value
Boolean
Remarks
 It is recommended practice to save local after SWC because otherwise local becomes incompatible with central.
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace